# Задание №8 Посчитать, сколько раз определенная цифра в введенной введенной чисел.
# Количество вводимых чисел и цифра, которое необходимо посчитать, задаются вводом с клавиатуры.

операнд  =  input ( 'Введите число \ n ' )
operator  =  input ( 'Введите цифру которую нужно найти во введенном числе \ n ' )
count  =  0
для  i  в  операнде :
    если  оператор i  ==  :
        count  + =  1
    еще :
        проходить

print ( f'В числе { операнд } цифра { оператор } встречается { count } раз / раза ' )